tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
static bool lcd_scope_prepare(const int16_t *samples, size_t n,
    const lv_area_t *obj_area, int16_t *scope_y);
static void lcd_scope_draw(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area, const int16_t *scope_y);
static bool lcd_constellation_prepare(const int16_t *i_samples,
    const int16_t *q_samples, size_t n, const lv_area_t *obj_area,
    int16_t *point_x, int16_t *point_y);
static void lcd_constellation_draw(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area, const int16_t *point_x, const int16_t *point_y);

/* Every native writer bypasses LVGL and indexes the physical framebuffer directly.
 * Keep one shared geometry gate so spectrum_attach() cannot turn an off-screen but
 * otherwise valid LVGL object into an unsigned framebuffer OOB write. */
static bool lcd_native_geometry_valid(const lv_area_t *obj_area) {
    int32_t screen_w = (int32_t)g_display0_cfg.input[0].hsize;
    int32_t screen_h = (int32_t)g_display0_cfg.input[0].vsize;
    int32_t native_w = (int32_t)LCD_WATERFALL_PIXELS + LCD_NATIVE_GAP_PX +
        (int32_t)LCD_SCOPE_PIXELS;
    int64_t native_right = (int64_t)obj_area->x1 + native_w;
    int64_t native_top = (int64_t)obj_area->y1 + LCD_WATERFALL_TOP_PAD;
    int64_t split_y = native_top + LCD_WATERFALL_SPEC_H + LCD_WATERFALL_GAP_PX;
    return (g_display0_cfg.input[0].p_base != NULL) &&
        (g_display0_cfg.input[0].hstride >= g_display0_cfg.input[0].hsize) &&
        (lv_area_get_width(obj_area) >= native_w) && (obj_area->x1 >= 0) &&
        (native_right <= screen_w) && (native_top >= 0) &&
        (split_y < obj_area->y2) && (obj_area->y2 < screen_h);
}

/* OFF owns only the native pixels below the 18 px LVGL label band.  Clear each
 * panel once from the timer, after the active-screen/pause gates, so setters never
 * write the framebuffer from an arbitrary Python/LVGL callback context. */
static void lcd_native_clear_pending(void) {
    if ((!s_lcd_left_clear_pending && !s_lcd_right_clear_pending) ||
        (s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj)) {
        return;
    }

    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    if (!lcd_native_geometry_valid(&obj_area)) {
        return;
    }

    uint32_t frame = lcd_vsync_counter;
    uint32_t wait_start = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == frame) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - wait_start) >= LCD_VSYNC_TIMEOUT_MS) {
            s_lcd_vsync_timeouts++;
            break;
        }
    }

    uint32_t stride = g_display0_cfg.input[0].hstride;
    uint16_t *fb = (uint16_t *)g_display0_cfg.input[0].p_base;
    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);
    int32_t y1 = obj_area.y1 + LCD_WATERFALL_TOP_PAD;
    for (int32_t y = y1; y <= obj_area.y2; ++y) {
        uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)obj_area.x1;
        if (s_lcd_left_clear_pending) {
            for (uint32_t x = 0U; x < LCD_WATERFALL_PIXELS; ++x) {
                row[x] = bg;
            }
        }
        if (s_lcd_right_clear_pending) {
            uint16_t *right = row + LCD_WATERFALL_PIXELS + LCD_NATIVE_GAP_PX;
            for (uint32_t x = 0U; x < LCD_SCOPE_PIXELS; ++x) {
                right[x] = bg;
            }
        }
    }
    s_lcd_left_clear_pending = 0U;
    s_lcd_right_clear_pending = 0U;
}

/* Direct single-framebuffer waterfall at the far-left 256 pixels.  The FFT is
 * peak-reduced to that width; the framebuffer itself is the history.  When a
 * fresh DAC scope frame is available its fixed screen coordinates are prepared
 * before the common VSYNC wait and drawn in the adjacent 128 pixels in the same
 * framebuffer transaction. */
static void lcd_waterfall_write(const float *magnitudes, float ref_peak,
    int32_t shift_bins, const int16_t *scope_samples, size_t scope_n,
    const int16_t *i_samples, const int16_t *q_samples, size_t iq_n) {
    if ((magnitudes == NULL) || !(ref_peak > 0.0f) ||
        (s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj)) {
        return;
    }

    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    int32_t obj_w = lv_area_get_width(&obj_area);
    uint32_t fft_n = (uint32_t)ra_iq_adc_spectrum_size();
    int32_t x1 = obj_area.x1;
    int32_t y1 = obj_area.y1 + LCD_WATERFALL_TOP_PAD + LCD_WATERFALL_SPEC_H +
        LCD_WATERFALL_GAP_PX;
    int32_t y2 = obj_area.y2;
    if ((fft_n < LCD_WATERFALL_PIXELS) || ((fft_n & (fft_n - 1U)) != 0U) ||
        (obj_w <= 0) || !lcd_native_geometry_valid(&obj_area) || (y1 >= y2)) {
        return;
    }

    int16_t scope_y[LCD_SCOPE_PIXELS];
    int16_t point_x[LCD_CONST_POINTS];
    int16_t point_y[LCD_CONST_POINTS];
    bool iq_view = s_lcd_scope_view == LCD_SCOPE_VIEW_IQ;
    bool right_valid = false;
    if (iq_view) {
        right_valid = lcd_constellation_prepare(i_samples, q_samples, iq_n,
            &obj_area, point_x, point_y);
    } else if (s_lcd_scope_view == LCD_SCOPE_VIEW_TIME) {
        right_valid = lcd_scope_prepare(scope_samples, scope_n, &obj_area, scope_y);
    }

    /* Start immediately after a fresh line-detect pulse.  The graph begins around
     * the middle of the panel, leaving several milliseconds for the bounded history
     * moves before GLCDC reaches the same scan lines. */
    uint32_t frame = lcd_vsync_counter;
    uint32_t wait_start = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == frame) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - wait_start) >= LCD_VSYNC_TIMEOUT_MS) {
            s_lcd_vsync_timeouts++;
            break;
        }
    }
    uint32_t t0 = (uint32_t)mp_hal_ticks_us();
    uint32_t stride = g_display0_cfg.input[0].hstride;
    uint16_t *fb = (uint16_t *)g_display0_cfg.input[0].p_base;
    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);

    if (s_lcd_waterfall_reset) {
        for (int32_t y = y1; y <= y2; ++y) {
            uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)x1;
            for (uint32_t x = 0U; x < LCD_WATERFALL_PIXELS; ++x) {
                row[x] = bg;
            }
        }
        s_lcd_waterfall_reset = 0U;
        /* A reset destroys the retained coordinate system.  Keep the most recent
         * absolute centre as the new baseline, but never replay movement that was
         * requested while there was no surviving history. */
        lcd_waterfall_pan_reset(false);
    } else if (s_lcd_waterfall_pan_pending_hz != 0) {
        /* Convert selected-frequency motion to physical pixels exactly once before
         * the vertical scroll.  Positive tuning moves old content left.  Carry the
         * signed fractional pixel numerator across frames so small steps accumulate
         * without jitter or drift. */
        int64_t scaled = -s_lcd_waterfall_pan_pending_hz *
            (int64_t)LCD_SPECTRUM_COLUMNS +
            (int64_t)s_lcd_waterfall_pan_remainder;
        s_lcd_waterfall_pan_pending_hz = 0;
        int64_t move_px = scaled / (int64_t)LCD_PANORAMA_SPAN_HZ;
        s_lcd_waterfall_pan_remainder =
            (int32_t)(scaled % (int64_t)LCD_PANORAMA_SPAN_HZ);
        uint32_t distance = (move_px <= -(int64_t)LCD_WATERFALL_PIXELS ||
            move_px >= (int64_t)LCD_WATERFALL_PIXELS) ? LCD_WATERFALL_PIXELS :
            (uint32_t)(move_px < 0 ? -move_px : move_px);
        if (distance >= LCD_WATERFALL_PIXELS) {
            s_lcd_waterfall_pan_remainder = 0;
        }
        if (distance != 0U) {
            for (int32_t y = y1; y <= y2; ++y) {
                uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)x1;
                if (distance >= LCD_WATERFALL_PIXELS) {
                    for (uint32_t x = 0U; x < LCD_WATERFALL_PIXELS; ++x) {
                        row[x] = bg;
                    }
                } else if (move_px < 0) {
                    memmove(row, row + distance,
                        (LCD_WATERFALL_PIXELS - distance) * sizeof(uint16_t));
                    for (uint32_t x = LCD_WATERFALL_PIXELS - distance;
                         x < LCD_WATERFALL_PIXELS; ++x) {
                        row[x] = bg;
                    }
                } else {
                    memmove(row + distance, row,
                        (LCD_WATERFALL_PIXELS - distance) * sizeof(uint16_t));
                    for (uint32_t x = 0U; x < distance; ++x) {
                        row[x] = bg;
                    }
                }
            }
        }
    }

    for (int32_t y = y2; y > y1; --y) {
        uint16_t *dst = fb + (uint32_t)y * stride + (uint32_t)x1;
        const uint16_t *src = dst - stride;
        memcpy(dst, src, LCD_WATERFALL_PIXELS * sizeof(uint16_t));
    }

    float inv = 1.0f / ref_peak;
    uint16_t *new_row = fb + (uint32_t)y1 * stride + (uint32_t)x1;
    lcd_waterfall_draw_frame(fb, stride, &obj_area, new_row, magnitudes, fft_n,
        inv, shift_bins);
    if (right_valid && iq_view) {
        lcd_constellation_draw(fb, stride, &obj_area, point_x, point_y);
    } else if (right_valid) {
        lcd_scope_draw(fb, stride, &obj_area, scope_y);
    }

    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - t0;
    s_lcd_waterfall_last_us = elapsed;
    if (elapsed > s_lcd_waterfall_max_us) {
        s_lcd_waterfall_max_us = elapsed;
    }
    s_lcd_waterfall_rows++;
}

