tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
static void lcd_constellation_line(uint16_t *fb, uint32_t stride,
    int32_t x0, int32_t y0, int32_t x1, int32_t y1, uint16_t color,
    int32_t clip_x1, int32_t clip_y1, int32_t clip_x2, int32_t clip_y2) {
    int32_t dx = (x1 >= x0) ? (x1 - x0) : (x0 - x1);
    int32_t sx = (x0 < x1) ? 1 : -1;
    int32_t dy_abs = (y1 >= y0) ? (y1 - y0) : (y0 - y1);
    int32_t dy = -dy_abs;
    int32_t sy = (y0 < y1) ? 1 : -1;
    int32_t err = dx + dy;
    for (;;) {
        if ((x0 >= clip_x1) && (x0 <= clip_x2) &&
            (y0 >= clip_y1) && (y0 <= clip_y2)) {
            fb[(uint32_t)y0 * stride + (uint32_t)x0] = color;
        }
        if ((x0 == x1) && (y0 == y1)) {
            break;
        }
        int32_t e2 = 2 * err;
        if (e2 >= dy) {
            err += dy;
            x0 += sx;
        }
        if (e2 <= dx) {
            err += dx;
            y0 += sy;
        }
    }
}

static void lcd_constellation_draw(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area, const int16_t *point_x, const int16_t *point_y) {
    int32_t x1 = obj_area->x1 + (int32_t)LCD_WATERFALL_PIXELS + LCD_NATIVE_GAP_PX;
    int32_t x2 = x1 + (int32_t)LCD_SCOPE_PIXELS - 1;
    int32_t y1 = obj_area->y1 + LCD_WATERFALL_TOP_PAD;
    int32_t y2 = obj_area->y2;
    int32_t center_x = (x1 + x2) / 2;
    int32_t center_y = obj_area->y1 + LCD_WATERFALL_TOP_PAD +
        LCD_WATERFALL_SPEC_H + LCD_WATERFALL_GAP_PX;
    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);
    uint16_t grid = lv_color_to_u16(s_lcd_spectrum_bar);
    uint16_t trace = lv_color_to_u16(s_lcd_spectrum_center);

    for (int32_t y = y1; y <= y2; ++y) {
        uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)x1;
        for (uint32_t x = 0U; x < LCD_SCOPE_PIXELS; ++x) {
            row[x] = bg;
        }
    }
    uint16_t *center_row = fb + (uint32_t)center_y * stride + (uint32_t)x1;
    for (uint32_t x = 0U; x < LCD_SCOPE_PIXELS; ++x) {
        center_row[x] = grid;
    }
    for (int32_t y = y1; y <= y2; ++y) {
        fb[(uint32_t)y * stride + (uint32_t)center_x] = grid;
    }

    for (uint32_t p = 1U; p < LCD_CONST_POINTS; ++p) {
        lcd_constellation_line(fb, stride, point_x[p - 1U], point_y[p - 1U],
            point_x[p], point_y[p], trace, x1, y1, x2, y2);
    }
    /* Make each observation visible even when several coherent samples overlap. */
    for (uint32_t p = 0U; p < LCD_CONST_POINTS; ++p) {
        int32_t x = point_x[p];
        int32_t y = point_y[p];
        fb[(uint32_t)y * stride + (uint32_t)x] = trace;
        if (x < x2) {
            fb[(uint32_t)y * stride + (uint32_t)(x + 1)] = trace;
        }
        if (y < y2) {
            fb[(uint32_t)(y + 1) * stride + (uint32_t)x] = trace;
        }
    }
}

/* Draw one persistent magnitude height per physical SPEC column.  The current
 * declarative state is committed together with the right-hand scope after one
 * VSYNC, without periodic LVGL invalidations. */
static void lcd_spectrum_draw_direct(uint16_t *fb, uint32_t stride,
    const lv_area_t *obj_area) {
    lv_area_t plot_area;
    lcd_lv_spectrum_plot_area(obj_area, &plot_area);
    uint16_t bg = lv_color_to_u16(s_lcd_spectrum_bg);
    uint16_t bar = lv_color_to_u16(s_lcd_spectrum_bar);
    int32_t plot_h = lv_area_get_height(&plot_area);

    for (int32_t y = plot_area.y1; y <= plot_area.y2; ++y) {
        uint16_t *row = fb + (uint32_t)y * stride + (uint32_t)plot_area.x1;
        for (uint32_t x = 0U; x < LCD_WATERFALL_PIXELS; ++x) {
            row[x] = bg;
        }
    }
    for (uint32_t x = 0U; x < LCD_SPECTRUM_COLUMNS; ++x) {
        int32_t height = s_lcd_spectrum_h[x];
        if (height <= 0) {
            continue;
        }
        if (height > plot_h) {
            height = plot_h;
        }
        int32_t px = plot_area.x1 + (int32_t)x;
        for (int32_t y = plot_area.y2 - height + 1; y <= plot_area.y2; ++y) {
            fb[(uint32_t)y * stride + (uint32_t)px] = bar;
        }
    }
    lcd_tune_cursor_draw_fb(fb, stride, &plot_area);
}

static void lcd_constellation_write(const int16_t *i_samples,
    const int16_t *q_samples, size_t n) {
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj)) {
        return;
    }
    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    if (!lcd_native_geometry_valid(&obj_area)) {
        return;
    }
    int16_t point_x[LCD_CONST_POINTS];
    int16_t point_y[LCD_CONST_POINTS];
    if (!lcd_constellation_prepare(i_samples, q_samples, n, &obj_area,
        point_x, point_y)) {
        return;
    }

    uint32_t frame = lcd_vsync_counter;
    uint32_t wait_start = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == frame) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - wait_start) >= LCD_VSYNC_TIMEOUT_MS) {
            s_lcd_vsync_timeouts++;
            break;
        }
    }
    uint32_t t0 = (uint32_t)mp_hal_ticks_us();
    uint32_t stride = g_display0_cfg.input[0].hstride;
    uint16_t *fb = (uint16_t *)g_display0_cfg.input[0].p_base;
    if (s_lcd_spectrum_view == LCD_VIEW_SPECTRUM) {
        lcd_spectrum_draw_direct(fb, stride, &obj_area);
    }
    lcd_constellation_draw(fb, stride, &obj_area, point_x, point_y);

    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - t0;
    s_lcd_waterfall_last_us = elapsed;
    if (elapsed > s_lcd_waterfall_max_us) {
        s_lcd_waterfall_max_us = elapsed;
    }
}

/* Commit the current SPEC state without depending on either right-panel producer.
 * This is what keeps left SPEC live when TIME, IQ, or the entire right panel is
 * unavailable/OFF. */
static void lcd_spectrum_write(void) {
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj)) {
        return;
    }
    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    if (!lcd_native_geometry_valid(&obj_area)) {
        return;
    }

    uint32_t frame = lcd_vsync_counter;
    uint32_t wait_start = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == frame) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - wait_start) >= LCD_VSYNC_TIMEOUT_MS) {
            s_lcd_vsync_timeouts++;
            break;
        }
    }
    uint32_t t0 = (uint32_t)mp_hal_ticks_us();
    lcd_spectrum_draw_direct((uint16_t *)g_display0_cfg.input[0].p_base,
        g_display0_cfg.input[0].hstride, &obj_area);

    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - t0;
    s_lcd_waterfall_last_us = elapsed;
    if (elapsed > s_lcd_waterfall_max_us) {
        s_lcd_waterfall_max_us = elapsed;
    }
}

/* Scope framebuffer transaction.  SPEC redraws its left panel in the same VSYNC
 * transaction.  A WF tick can reach this helper when the DAC frame is ready but
 * the FFT frame is not; in that case the left framebuffer is the waterfall
 * history and must not be touched. */
static void lcd_scope_write(const int16_t *samples, size_t n) {
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj) ||
        !lv_obj_is_visible(s_lcd_spectrum_obj)) {
        return;
    }
    lv_area_t obj_area;
    lv_obj_get_coords(s_lcd_spectrum_obj, &obj_area);
    if (!lcd_native_geometry_valid(&obj_area)) {
        return;
    }
    int16_t scope_y[LCD_SCOPE_PIXELS];
    if (!lcd_scope_prepare(samples, n, &obj_area, scope_y)) {
        return;
    }

    uint32_t frame = lcd_vsync_counter;
    uint32_t wait_start = (uint32_t)mp_hal_ticks_ms();
    while (lcd_vsync_counter == frame) {
        if ((uint32_t)((uint32_t)mp_hal_ticks_ms() - wait_start) >= LCD_VSYNC_TIMEOUT_MS) {
            s_lcd_vsync_timeouts++;
            break;
        }
    }
    uint32_t t0 = (uint32_t)mp_hal_ticks_us();
    uint32_t stride = g_display0_cfg.input[0].hstride;
    uint16_t *fb = (uint16_t *)g_display0_cfg.input[0].p_base;
    if (s_lcd_spectrum_view == LCD_VIEW_SPECTRUM) {
        lcd_spectrum_draw_direct(fb, stride, &obj_area);
    }
    lcd_scope_draw(fb, stride, &obj_area, scope_y);

    uint32_t elapsed = (uint32_t)mp_hal_ticks_us() - t0;
    s_lcd_waterfall_last_us = elapsed;
    if (elapsed > s_lcd_waterfall_max_us) {
        s_lcd_waterfall_max_us = elapsed;
    }
}

/* The two native panels are independent consumers.  SPEC consumes one raw FFT
 * frame at 10 Hz; TIME/IQ run at 30 Hz.  WF combines ready left/right data in one
 * transaction, while either OFF state consumes no frame for that panel. */
static void lcd_lv_spectrum_timer_cb(lv_timer_t *timer) {
    (void)timer;
    if (s_lcd_spectrum_obj == NULL) {
        return;
    }
    if (!lv_obj_is_valid(s_lcd_spectrum_obj)) {
        s_lcd_spectrum_obj = NULL;
        lcd_native_capture_apply(false);
        return;
    }
    /* Direct framebuffer pixels are legal only on the HOME receiver screen and
     * while no same-screen modal overlay is open.  lv_obj_is_visible() alone is
     * insufficient: objects on an inactive LVGL screen still have no HIDDEN flag. */
    if (s_lcd_spectrum_paused ||
        (lv_obj_get_screen(s_lcd_spectrum_obj) != lv_screen_active())) {
        return;
    }

