tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    lcd_native_clear_pending();
    if ((s_lcd_spectrum_view == LCD_VIEW_OFF) &&
        (s_lcd_scope_view == LCD_SCOPE_VIEW_OFF)) {
        return;
    }

    uint32_t now = (uint32_t)mp_hal_ticks_ms();
    #if defined(MICROPY_HW_ENABLE_IQ_ADC) && (MICROPY_HW_ENABLE_IQ_ADC == 1)
    if (s_lcd_spectrum_view == LCD_VIEW_WATERFALL) {
        if ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >= LCD_WATERFALL_FRAME_MS) {
            /* Advance the deadline, not "last = now".  The measured panel is 50 Hz;
             * retaining the 33 ms phase yields a 20/40/40 ms VSYNC pattern and a
             * true 30 rows/s average instead of rounding every update down to 25 Hz. */
            if ((s_lcd_spectrum_last_fft_ms == 0U) ||
                ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >
                 (3U * LCD_WATERFALL_FRAME_MS))) {
                s_lcd_spectrum_last_fft_ms = now;
            } else {
                s_lcd_spectrum_last_fft_ms += LCD_WATERFALL_FRAME_MS;
            }
            const float *magnitudes;
            float ref_peak;
            int32_t shift_bins;
            const int16_t *scope_samples = NULL;
            size_t scope_n = 0U;
            const int16_t *i_samples = NULL;
            const int16_t *q_samples = NULL;
            size_t iq_n = 0U;
            bool scope_ready = false;
            bool iq_ready = false;
            if (s_lcd_scope_view == LCD_SCOPE_VIEW_TIME) {
                scope_ready = ra_iq_adc_scope_frame(&scope_samples, &scope_n);
            } else if (s_lcd_scope_view == LCD_SCOPE_VIEW_IQ) {
                iq_ready = ra_iq_adc_constellation_frame(&i_samples, &q_samples,
                    &iq_n);
            }
            uint32_t fft_t0 = (uint32_t)mp_hal_ticks_us();
            bool ready = ra_iq_adc_spectrum_frame(&magnitudes, &ref_peak, &shift_bins,
                NULL, NULL, NULL);
            uint32_t fft_elapsed = (uint32_t)mp_hal_ticks_us() - fft_t0;
            if (ready) {
                s_lcd_fft_last_us = fft_elapsed;
                if (fft_elapsed > s_lcd_fft_max_us) {
                    s_lcd_fft_max_us = fft_elapsed;
                }
                lcd_waterfall_write(magnitudes, ref_peak, shift_bins,
                    scope_ready ? scope_samples : NULL, scope_n,
                    iq_ready ? i_samples : NULL, iq_ready ? q_samples : NULL, iq_n);
            } else if (scope_ready) {
                lcd_scope_write(scope_samples, scope_n);
            } else if (iq_ready) {
                lcd_constellation_write(i_samples, q_samples, iq_n);
            }
        }
        return;
    }

    if ((s_lcd_scope_view != LCD_SCOPE_VIEW_OFF) &&
        ((uint32_t)(now - s_lcd_scope_last_ms) >= LCD_SCOPE_FRAME_MS)) {
        if ((s_lcd_scope_last_ms == 0U) ||
            ((uint32_t)(now - s_lcd_scope_last_ms) >
                 (3U * LCD_SCOPE_FRAME_MS))) {
            s_lcd_scope_last_ms = now;
        } else {
            s_lcd_scope_last_ms += LCD_SCOPE_FRAME_MS;
        }
        if (s_lcd_scope_view == LCD_SCOPE_VIEW_IQ) {
            const int16_t *i_samples;
            const int16_t *q_samples;
            size_t iq_n;
            if (ra_iq_adc_constellation_frame(&i_samples, &q_samples, &iq_n)) {
                lcd_constellation_write(i_samples, q_samples, iq_n);
            }
        } else if (s_lcd_scope_view == LCD_SCOPE_VIEW_TIME) {
            const int16_t *samples;
            size_t sample_count;
            if (ra_iq_adc_scope_frame(&samples, &sample_count)) {
                lcd_scope_write(samples, sample_count);
            }
        }
    }

    if ((s_lcd_spectrum_view == LCD_VIEW_SPECTRUM) &&
        ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >= LCD_SPECTRUM_FRAME_MS)) {
        if ((s_lcd_spectrum_last_fft_ms == 0U) ||
            ((uint32_t)(now - s_lcd_spectrum_last_fft_ms) >
             (3U * LCD_SPECTRUM_FRAME_MS))) {
            s_lcd_spectrum_last_fft_ms = now;
        } else {
            s_lcd_spectrum_last_fft_ms += LCD_SPECTRUM_FRAME_MS;
        }
        const float *magnitudes;
        float ref_peak;
        int32_t shift_bins;
        uint32_t fft_t0 = (uint32_t)mp_hal_ticks_us();
        bool ready = ra_iq_adc_spectrum_frame(&magnitudes, &ref_peak, &shift_bins,
            NULL, NULL, NULL);
        uint32_t fft_elapsed = (uint32_t)mp_hal_ticks_us() - fft_t0;
        if (ready) {
            s_lcd_fft_last_us = fft_elapsed;
            if (fft_elapsed > s_lcd_fft_max_us) {
                s_lcd_fft_max_us = fft_elapsed;
            }
            if (lcd_spectrum_state_from_frame(magnitudes,
                (uint32_t)ra_iq_adc_spectrum_size(), ref_peak, shift_bins)) {
                lcd_spectrum_write();
            }
        }
    }
    #endif
}

static void lcd_lv_spectrum_event_cb(lv_event_t *e) {
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t *obj = lv_event_get_target_obj(e);
    if (code == LV_EVENT_DELETE) {
        if (obj == s_lcd_spectrum_obj) {
            s_lcd_spectrum_obj = NULL;
            s_lcd_spectrum_valid = 0U;
            lcd_waterfall_pan_reset(false);
            s_lcd_left_clear_pending = 0U;
            s_lcd_right_clear_pending = 0U;
            lcd_native_capture_apply(false);
            if (s_lcd_spectrum_timer != NULL) {
                lv_timer_delete(s_lcd_spectrum_timer);
                s_lcd_spectrum_timer = NULL;
            }
        }
        return;
    }
    if ((code != LV_EVENT_DRAW_MAIN) || (obj != s_lcd_spectrum_obj)) {
        return;
    }

    if ((s_lcd_spectrum_view == LCD_VIEW_WATERFALL) ||
        (s_lcd_spectrum_view == LCD_VIEW_OFF)) {
        /* The framebuffer itself is the waterfall history. Routine LVGL redraws
         * can reach this transparent object, so never clear the full native area
         * here. True ownership changes request an explicit reset elsewhere. */
        return;
    }

    lv_layer_t *layer = lv_event_get_layer(e);
    lv_area_t obj_area;
    lv_area_t plot_area;
    lv_obj_get_coords(obj, &obj_area);
    lcd_lv_spectrum_plot_area(&obj_area, &plot_area);

    lv_draw_rect_dsc_t rect;
    lv_draw_rect_dsc_init(&rect);
    rect.bg_opa = LV_OPA_COVER;
    rect.border_opa = LV_OPA_TRANSP;
    rect.radius = 0;

