tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA6M3/machine_lcd.c
    int64_t delta_hz = (int64_t)selected_hz -
        (int64_t)s_lcd_waterfall_center_hz;
    s_lcd_waterfall_center_hz = selected_hz;
    if ((delta_hz != 0) && !s_lcd_waterfall_reset &&
        !s_lcd_spectrum_paused &&
        (s_lcd_spectrum_view == LCD_VIEW_WATERFALL)) {
        s_lcd_waterfall_pan_pending_hz += delta_hz;
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(machine_lcd_spectrum_center_obj,
    lcd_spectrum_center);

// spectrum([view]) -- left native panel: 0 = bars, 1 = waterfall, 2 = OFF.
// With no argument return:
// (view, direct_rows, last_write_us, max_write_us, last_fft_us, max_fft_us).
STATIC mp_obj_t lcd_spectrum(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        mp_obj_t t[6] = {
            MP_OBJ_NEW_SMALL_INT(s_lcd_spectrum_view),
            mp_obj_new_int_from_uint(s_lcd_waterfall_rows),
            mp_obj_new_int_from_uint(s_lcd_waterfall_last_us),
            mp_obj_new_int_from_uint(s_lcd_waterfall_max_us),
            mp_obj_new_int_from_uint(s_lcd_fft_last_us),
            mp_obj_new_int_from_uint(s_lcd_fft_max_us),
        };
        return mp_obj_new_tuple(MP_ARRAY_SIZE(t), t);
    }

    mp_int_t view = mp_obj_get_int(args[1]);
    if ((view != (mp_int_t)LCD_VIEW_SPECTRUM) &&
        (view != (mp_int_t)LCD_VIEW_WATERFALL) &&
        (view != (mp_int_t)LCD_VIEW_OFF)) {
        mp_raise_ValueError(MP_ERROR_TEXT("view must be 0, 1, or 2"));
    }
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        return mp_const_false;
    }
    if ((uint8_t)view != s_lcd_spectrum_view) {
        s_lcd_spectrum_view = (uint8_t)view;
        s_lcd_left_clear_pending =
            (view == (mp_int_t)LCD_VIEW_OFF) ? 1U : 0U;
        s_lcd_spectrum_valid = 0U;
        s_lcd_waterfall_reset = 1U;
        lcd_waterfall_pan_reset(false);
        s_lcd_spectrum_last_fft_ms = 0U;
        s_lcd_scope_last_ms = 0U;
        s_lcd_const_peak = 32;
        s_lcd_waterfall_rows = 0U;
        s_lcd_waterfall_last_us = 0U;
        s_lcd_waterfall_max_us = 0U;
        s_lcd_fft_last_us = 0U;
        s_lcd_fft_max_us = 0U;
        lcd_native_capture_apply(true);
        lv_obj_invalidate(s_lcd_spectrum_obj);
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_obj, 1, 2,
    lcd_spectrum);

// scope_view([view]) -- right native panel: 0 = played DAC time trace,
// 1 = I/Q constellation from the independent final-complex snapshot, 2 = OFF.
STATIC mp_obj_t lcd_scope_view(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        return MP_OBJ_NEW_SMALL_INT(s_lcd_scope_view);
    }
    mp_int_t view = mp_obj_get_int(args[1]);
    if ((view != (mp_int_t)LCD_SCOPE_VIEW_TIME) &&
        (view != (mp_int_t)LCD_SCOPE_VIEW_IQ) &&
        (view != (mp_int_t)LCD_SCOPE_VIEW_OFF)) {
        mp_raise_ValueError(MP_ERROR_TEXT("view must be 0, 1, or 2"));
    }
    if ((s_lcd_spectrum_obj == NULL) || !lv_obj_is_valid(s_lcd_spectrum_obj)) {
        return mp_const_false;
    }
    if ((uint8_t)view != s_lcd_scope_view) {
        s_lcd_scope_view = (uint8_t)view;
        s_lcd_right_clear_pending =
            (view == (mp_int_t)LCD_SCOPE_VIEW_OFF) ? 1U : 0U;
        s_lcd_scope_last_ms = 0U;
        s_lcd_const_peak = 32;
        lcd_native_capture_apply(true);
        /* Do not invalidate the whole transparent native object here: in WF mode
         * its framebuffer pixels are retained history.  The timer either performs
         * the pending OFF clear or rebuilds only the right panel from a fresh frame. */
    }
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_scope_view_obj, 1, 2,
    lcd_scope_view);

// spectrum_pause([pause]) -- stop direct framebuffer writes while a same-screen
// modal overlay covers the receiver.  Inactive full screens are rejected by the
// C timer independently, so this flag is only needed for overlays on HOME itself.
STATIC mp_obj_t lcd_spectrum_pause(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    if (n_args == 1U) {
        return mp_obj_new_bool(s_lcd_spectrum_paused != 0U);
    }

    uint8_t paused = mp_obj_is_true(args[1]) ? 1U : 0U;
    if (paused != s_lcd_spectrum_paused) {
        s_lcd_spectrum_paused = paused;
        lcd_waterfall_pan_reset(false);
        if (!paused && (s_lcd_spectrum_obj != NULL) &&
            lv_obj_is_valid(s_lcd_spectrum_obj)) {
            /* The overlay/full-screen redraw owns these framebuffer pixels while
             * paused.  Rebuild the whole native surface on the first HOME frame. */
            s_lcd_waterfall_reset = 1U;
            s_lcd_spectrum_last_fft_ms = 0U;
            s_lcd_scope_last_ms = 0U;
            lv_obj_invalidate(s_lcd_spectrum_obj);
        }
    }
    /* IQADC init/deinit deliberately clears every optional display producer.
     * Re-apply the selected capture matrix even when the pause value itself is
     * unchanged, so an idempotent resume after RX start repairs that lifecycle
     * boundary without cycling TIME/I-Q/OFF or destroying waterfall history. */
    lcd_native_capture_apply(true);
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_spectrum_pause_obj, 1, 2,
    lcd_spectrum_pause);

// scroll_rect(x, y, w, h, dy) -> bool
// Partial mode cannot move scanout pixels behind LVGL's staging buffer. Returning
// False asks the caller to use its complete LVGL redraw path.
STATIC mp_obj_t lcd_scroll_rect(size_t n_args, const mp_obj_t *args) {
    (void)n_args;
    (void)args;
    /* A direct framebuffer move would bypass the staged partial buffer and can
     * tear. Returning False selects sdr_single.py's existing full-redraw path. */
    return mp_const_false;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_scroll_rect_obj, 6, 6,
    lcd_scroll_rect);

// render_debug([reset]) -> (last_us, max_us, frame_crossings, line_pulses,
//                           render_count, last_inv_requests, max_inv_requests,
//                           full_inv_requests, vsync_timeouts, beam_delay_last_us,
//                           beam_delay_max_us, beam_delay_count, no_window_count,
//                           area_y1, area_y2, area_height, beam_estimate_us,
//                           flush_last_us, flush_max_us, flush_count,
//                           flush_last_bytes, flush_max_bytes, flush_vsync_waits)
// Fields 9..16 are retained for Build 33 diagnostic compatibility and stay zero in
// partial mode. Draw timing excludes the VSYNC wait and framebuffer copy.
STATIC mp_obj_t lcd_render_debug(size_t n_args, const mp_obj_t *args) {
    (void)args[0];
    mp_obj_t t[23] = {
        mp_obj_new_int_from_uint(s_lcd_render_last_us),
        mp_obj_new_int_from_uint(s_lcd_render_max_us),
        mp_obj_new_int_from_uint(s_lcd_render_crossed_frames),
        mp_obj_new_int_from_uint(lcd_vsync_counter),
        mp_obj_new_int_from_uint(s_lcd_render_count),
        mp_obj_new_int_from_uint(s_lcd_render_inv_count),
        mp_obj_new_int_from_uint(s_lcd_render_max_inv_count),
        mp_obj_new_int_from_uint(s_lcd_render_full_inv_request_count),
        mp_obj_new_int_from_uint(s_lcd_vsync_timeouts),
        mp_obj_new_int_from_uint(s_lcd_beam_delay_last_us),
        mp_obj_new_int_from_uint(s_lcd_beam_delay_max_us),
        mp_obj_new_int_from_uint(s_lcd_beam_delay_count),
        mp_obj_new_int_from_uint(s_lcd_beam_no_window_count),
        mp_obj_new_int(s_lcd_render_y1),
        mp_obj_new_int(s_lcd_render_y2),
        mp_obj_new_int_from_uint(s_lcd_render_area_height),
        mp_obj_new_int_from_uint(s_lcd_beam_estimate_us),
        mp_obj_new_int_from_uint(s_lcd_flush_last_us),
        mp_obj_new_int_from_uint(s_lcd_flush_max_us),
        mp_obj_new_int_from_uint(s_lcd_flush_count),
        mp_obj_new_int_from_uint(s_lcd_flush_last_bytes),
        mp_obj_new_int_from_uint(s_lcd_flush_max_bytes),
        mp_obj_new_int_from_uint(s_lcd_flush_vsync_wait_count),
    };
    mp_obj_t result = mp_obj_new_tuple(MP_ARRAY_SIZE(t), t);
    if ((n_args > 1U) && mp_obj_is_true(args[1])) {
        s_lcd_render_last_us = 0U;
        s_lcd_render_max_us = 0U;
        s_lcd_render_crossed_frames = 0U;
        s_lcd_render_count = 0U;
        s_lcd_inv_since_render = 0U;
        s_lcd_render_inv_count = 0U;
        s_lcd_render_max_inv_count = 0U;
        s_lcd_render_full_inv_request_count = 0U;
        lcd_render_dirty_bounds_reset();
        s_lcd_render_y1 = -1;
        s_lcd_render_y2 = -1;
        s_lcd_render_area_height = 0U;
        s_lcd_render_previous_height = 0U;
        s_lcd_render_previous_inv_count = 0U;
        s_lcd_beam_estimate_us = 0U;
        s_lcd_beam_delay_last_us = 0U;
        s_lcd_beam_delay_max_us = 0U;
        s_lcd_beam_delay_count = 0U;
        s_lcd_beam_no_window_count = 0U;
        s_lcd_render_chunk_start_us = 0U;
        s_lcd_flush_last_us = 0U;
        s_lcd_flush_max_us = 0U;
        s_lcd_flush_count = 0U;
        s_lcd_flush_last_bytes = 0U;
        s_lcd_flush_max_bytes = 0U;
        s_lcd_flush_vsync_wait_count = 0U;
        s_lcd_vsync_timeouts = 0U;
    }
    return result;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_lcd_render_debug_obj, 1, 2,
    lcd_render_debug);

// lvgl_setup() -- create the LVGL display + pointer indev in C with C callbacks, so no
// Python wrapper is allocated per frame or per input poll. Call once after lv.init().
// Returns True if the C bridge was installed (idempotent). pRGB uses it when present and
// keeps its Python callbacks only as a fallback for firmware without this method.
STATIC mp_obj_t lcd_lvgl_setup(mp_obj_t self_in) {
    (void)self_in;
    if (s_lcd_lvgl_bridged) {
        return mp_const_true;
    }
    if (!lv_is_initialized()) {
        lv_init();
    }
    uint32_t w = g_display0_cfg.input[0].hsize;
    uint32_t h = g_display0_cfg.input[0].vsize;

    lv_display_t *disp = lv_display_create(w, h);
    if (disp == NULL) {
        return mp_const_false;
    }
    lv_display_set_color_format(disp, LV_COLOR_FORMAT_RGB565);
    lv_display_set_flush_cb(disp, lcd_lv_flush_cb);
    memset(s_lcd_lvgl_draw_buffer, 0, sizeof(s_lcd_lvgl_draw_buffer));
    lv_display_set_buffers(disp, s_lcd_lvgl_draw_buffer, NULL,
        sizeof(s_lcd_lvgl_draw_buffer), LV_DISPLAY_RENDER_MODE_PARTIAL);
    lv_display_add_event_cb(disp, lcd_lv_invalidate_area_cb, LV_EVENT_INVALIDATE_AREA, NULL);
    lv_display_add_event_cb(disp, lcd_lv_render_start_cb, LV_EVENT_RENDER_START, NULL);
    lv_display_add_event_cb(disp, lcd_lv_render_ready_cb, LV_EVENT_RENDER_READY, NULL);

    lv_indev_t *indev = lv_indev_create();
    lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
    lv_indev_set_display(indev, disp);
    lv_indev_set_read_cb(indev, lcd_lv_indev_read_cb);

    s_lcd_render_count = 0U;
    s_lcd_inv_since_render = 0U;
    s_lcd_render_inv_count = 0U;
    s_lcd_render_max_inv_count = 0U;
    s_lcd_render_full_inv_request_count = 0U;
    lcd_render_dirty_bounds_reset();
    s_lcd_render_y1 = -1;
    s_lcd_render_y2 = -1;
    s_lcd_render_area_height = 0U;
    s_lcd_render_previous_height = 0U;
    s_lcd_render_previous_inv_count = 0U;
    s_lcd_beam_estimate_us = 0U;
    s_lcd_beam_delay_last_us = 0U;
    s_lcd_beam_delay_max_us = 0U;
    s_lcd_beam_delay_count = 0U;
    s_lcd_beam_no_window_count = 0U;
    s_lcd_render_chunk_start_us = 0U;
    s_lcd_flush_last_us = 0U;
    s_lcd_flush_max_us = 0U;
    s_lcd_flush_count = 0U;
    s_lcd_flush_last_bytes = 0U;
    s_lcd_flush_max_bytes = 0U;
    s_lcd_flush_vsync_wait_count = 0U;
    s_lcd_vsync_timeouts = 0U;
    s_lcd_lvgl_display = disp;
    s_lcd_lvgl_bridged = 1;
    return mp_const_true;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_lcd_lvgl_setup_obj, lcd_lvgl_setup);

